Revit 2024 API
ElectricalLoadClassification Class
 The ElectricalLoadClassification class represents a serialized version of an instance of load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ElectricalLoadClassification : Element
Visual Basic
Public Class ElectricalLoadClassification _
	Inherits Element
Visual C++
public ref class ElectricalLoadClassification : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalLoadClassification
See Also
ElectricalLoadClassification Members
Autodesk.Revit.DB.Electrical Namespace